Tekla.Structures.Analysis.AnalysisMember.#ctor
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisMember class.

Tekla.Structures.Analysis.AnalysisMember.Material
Gets or sets the material of the analysis member.

Tekla.Structures.Analysis.AnalysisMember.Label
Gets or sets the label of the analysis member.

Tekla.Structures.Analysis.AnalysisMember.Start
Gets or sets the analysis beam end settings at the start of the member.

Tekla.Structures.Analysis.AnalysisMember.End
Gets or sets the analysis beam end settings at the end of the member.

Tekla.Structures.Analysis.AnalysisMember.Curvature
Gets or sets the beam curvature of the member.

Tekla.Structures.Analysis.AnalysisMember.Composite
Gets or sets the composite settings of the member.

Tekla.Structures.Analysis.AnalysisMember.AnalysisDesignCode
Gets or sets the analysis design code of the member.

Tekla.Structures.Analysis.AnalysisMember.Select
Selects an analysis member.
The AnalysisModelName and ID have to be set.